РезервированиеТоваров/Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РЗ_ПотребностьВТоварах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РезервированиеТоваров/AccumulationRegisters/РЗ_ПотребностьВТоварах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РЗ_ПотребностьВТоварах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

РезервированиеТоваров/Documents/ПоступлениеТоваровУслуг/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура РЗ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РЗ_ПотребностьВТоварах.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ДанныеПоступления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РЗ_ПотребностьВТоварахОстатки.Номенклатура КАК Номенклатура,
	|	РЗ_ПотребностьВТоварахОстатки.СчетПокупателю КАК СчетПокупателю,
	|	ВЫБОР
	|		КОГДА РЗ_ПотребностьВТоварахОстатки.КоличествоОстаток < ВТ_ДанныеПоступления.Количество
	|			ТОГДА РЗ_ПотребностьВТоварахОстатки.КоличествоОстаток
	|		ИНАЧЕ ВТ_ДанныеПоступления.Количество
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ВТ_ДанныеПоступления КАК ВТ_ДанныеПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РЗ_ПотребностьВТоварах.Остатки(&Период, ) КАК РЗ_ПотребностьВТоварахОстатки
	|		ПО ВТ_ДанныеПоступления.Номенклатура = РЗ_ПотребностьВТоварахОстатки.Номенклатура
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РЗ_ПотребностьВТоварахОстатки.КоличествоОстаток < ВТ_ДанныеПоступления.Количество
	|				ТОГДА РЗ_ПотребностьВТоварахОстатки.КоличествоОстаток
	|			ИНАЧЕ ВТ_ДанныеПоступления.Количество
	|		КОНЕЦ > 0";
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Для каждого ТекСтрока Из ТаблицаЗначений Цикл
		Движение = Движения.РЗ_ПотребностьВТоварах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры
